<h1>Регистрация</h1>

{{if:if_success:<p>Вы успешно зарегистрированы. <a href="/auth/show_login_form/">Войти на сайт</a></p>}}

{{if:if_use_registration_form:<p>Пожалуйста, воспользуйтесь формой регистрации.</p>}}

{{if:if_wrong_captcha:<p>Неверно введён проверочный код</p>}}

{{if:if_empty_password:<p>Пожалуйста, введите пароль</p>}}

{{if:if_passwords_not_equal:<p>Введённые Вами пароли не совпадают.</p>}}

{{if:if_weak_password:<p>Пароль должен быть не менее 8 символов длиной и содержать большие и маленькие буквы и цифры</p>}}

{{if:if_login_exists:<p>Такой e-mail уже зарегистрирован, вместо новой регистрации воспользуйтесь, пожалуйста, функцией напоминания пароля.</p>}}


#content#

